perftest-instance/sysbench.disk.output
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 64MiB each
8GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!

Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       0.016 |*                                        1
       0.017 |*                                        1
       0.018 |*                                        1
       0.018 |*                                        1
       0.019 |*                                        1
       0.020 |*                                        1
       0.020 |*                                        1
       0.021 |*                                        1
       0.026 |*                                        1
       0.026 |*                                        1
       0.027 |*                                        1
       0.027 |*                                        1
       0.028 |*                                        1
       0.028 |*                                        1
       0.029 |*                                        1
       0.044 |*                                        1
       0.050 |**                                       2
       0.053 |*                                        1
       0.060 |*                                        1
       0.061 |*                                        1
       0.062 |***                                      3
       0.066 |**                                       2
       0.070 |*                                        1
       0.077 |*                                        1
       0.078 |*                                        1
       0.079 |******                                   5
       0.081 |*****                                    4
       0.082 |**                                       2
       0.084 |******                                   5
       0.085 |***                                      3
       0.087 |*****                                    4
       0.089 |*****                                    4
       0.090 |*******                                  6
       0.092 |***                                      3
       0.093 |*********                                8
       0.095 |***********                              10
       0.097 |*****                                    4
       0.099 |***********                              10
       0.100 |*******                                  6
       0.102 |**                                       2
       0.104 |*******                                  6
       0.106 |*****                                    4
       0.108 |*                                        1
       0.110 |***                                      3
       0.112 |***                                      3
       0.114 |*****                                    4
       0.116 |***                                      3
       0.118 |**                                       2
       0.120 |***                                      3
       0.122 |**                                       2
       0.125 |*****                                    4
       0.127 |***                                      3
       0.129 |**                                       2
       0.132 |*****                                    4
       0.134 |***                                      3
       0.136 |***                                      3
       0.139 |**                                       2
       0.141 |*                                        1
       0.144 |***                                      3
       0.147 |***                                      3
       0.152 |*                                        1
       0.155 |*                                        1
       0.182 |*                                        1
       0.252 |*                                        1
       0.280 |*                                        1
       0.456 |*                                        1
       0.464 |*                                        1
       0.499 |**                                       2
       0.508 |*                                        1
       0.536 |*                                        1
       0.546 |*                                        1
       0.556 |***                                      3
       0.566 |**                                       2
       0.576 |***********                              10
       0.587 |**********************                   19
       0.597 |*****************************            25
       0.608 |**************************************** 35
       0.619 |************************                 21
       0.630 |**************************               23
       0.642 |*******                                  6
       0.654 |********                                 7
       0.665 |*******                                  6
       0.677 |******                                   5
       0.690 |*                                        1
       0.702 |***                                      3
       0.715 |***                                      3
       0.741 |*                                        1
       0.755 |*                                        1
       0.768 |*****************                        15
       0.782 |*************                            11
       0.797 |**************************               23
       0.811 |***********                              10
       0.826 |********                                 7
       0.841 |*****                                    4
       0.856 |***                                      3
       0.872 |**                                       2
       0.888 |******                                   5
       0.904 |**                                       2
       0.920 |*                                        1
       0.937 |*                                        1
       0.954 |*                                        1
       1.007 |*                                        1
       1.025 |**                                       2
       1.044 |*                                        1
       1.122 |**                                       2
       4.176 |*                                        1
       4.737 |*                                        1
       4.823 |*                                        1
       4.999 |*                                        1
       5.090 |*                                        1
       5.183 |*                                        1
       5.277 |**                                       2
       5.373 |*                                        1
       5.671 |*                                        1
       5.774 |*                                        1
       5.879 |*                                        1
       5.986 |*                                        1
       6.095 |**                                       2
       6.433 |*                                        1
       6.550 |*                                        1
       6.790 |**                                       2
       7.039 |***                                      3
       7.167 |***                                      3
       7.297 |**                                       2
       7.430 |**                                       2
       7.702 |*                                        1
       7.842 |*****                                    4
       7.985 |**                                       2
       8.130 |*                                        1
       8.277 |*                                        1
       8.428 |**                                       2
       8.581 |***                                      3
       8.737 |*                                        1
       8.895 |***                                      3
       9.222 |**                                       2
       9.389 |***                                      3
       9.560 |**                                       2
       9.734 |*                                        1
       9.910 |***                                      3
      10.090 |***                                      3
      10.274 |***                                      3
      10.460 |**                                       2
      10.651 |******                                   5
      10.844 |***                                      3
      11.041 |*                                        1
      11.242 |**                                       2
      11.446 |*******                                  6
      11.654 |*                                        1
      11.866 |*                                        1
      12.081 |**                                       2
      12.301 |***                                      3
      12.752 |*******                                  6
      12.984 |******                                   5
      13.219 |**                                       2
      13.460 |********                                 7
      13.704 |*                                        1
      13.953 |******                                   5
      14.207 |**                                       2
      14.465 |**                                       2
      14.728 |*                                        1
      15.268 |*                                        1
      15.545 |*                                        1
      15.828 |*                                        1
      16.115 |*                                        1
      16.408 |*                                        1
      16.706 |*                                        1
      17.010 |*                                        1
      17.319 |**                                       2
      17.954 |*                                        1
      18.280 |*                                        1
      18.612 |**                                       2
      19.295 |*****                                    4
      19.645 |*                                        1
      20.002 |***                                      3
      20.366 |**                                       2
      20.736 |******                                   5
      21.112 |*                                        1
      21.496 |***                                      3
      22.284 |*                                        1
      22.689 |**                                       2
      24.384 |**                                       2
      25.278 |***                                      3
      26.205 |*                                        1
      27.659 |*                                        1
      28.162 |*                                        1
      29.194 |*                                        1
      29.725 |*                                        1
      30.265 |*                                        1
      31.375 |*                                        1
      31.945 |*                                        1
      33.116 |*                                        1
      33.718 |*                                        1
      34.954 |*                                        1
      36.236 |*                                        1
      37.565 |*                                        1
      38.247 |*                                        1
      38.942 |**                                       2
      39.650 |*****                                    4
      40.370 |***                                      3
      41.104 |*****                                    4
      41.851 |*****                                    4
      42.611 |******                                   5
      43.385 |********                                 7
      44.173 |********                                 7
      44.976 |**********                               9
      45.793 |*******                                  6
      46.625 |********                                 7
      47.472 |*************                            11
      48.335 |***********                              10
      49.213 |********                                 7
      50.107 |****************                         14
      51.018 |*********                                8
      51.945 |*********                                8
      52.889 |*******                                  6
      53.850 |*************                            11
      54.828 |*****                                    4
      55.824 |***********                              10
      56.839 |**********                               9
      57.871 |**************                           12
      58.923 |******                                   5
      59.993 |******                                   5
      61.083 |********                                 7
      62.193 |******                                   5
      63.323 |*******                                  6
      64.474 |******                                   5
      65.645 |***                                      3
      66.838 |**                                       2
      68.053 |**                                       2
      69.289 |*******                                  6
      70.548 |***                                      3
      71.830 |***                                      3
      73.135 |***                                      3
      74.464 |**                                       2
      75.817 |**                                       2
      77.194 |**                                       2
      78.597 |**                                       2
      80.025 |*******                                  6
      81.479 |***                                      3
      82.959 |**                                       2
      84.467 |******                                   5
      86.002 |*****                                    4
      87.564 |*****                                    4
      89.155 |*                                        1
      90.775 |**                                       2
      94.104 |*                                        1
      95.814 |**                                       2
      97.555 |***                                      3
      99.327 |*                                        1
     101.132 |***                                      3
     102.969 |*                                        1
     104.840 |*                                        1
     112.670 |*                                        1
     114.717 |*                                        1
     116.802 |*                                        1
     125.525 |*                                        1
     127.805 |*                                        1
     134.899 |**                                       2
     137.350 |*                                        1
     161.514 |*                                        1
     196.894 |*                                        1


File operations:
    reads/s:                      23.11
    writes/s:                     15.40
    fsyncs/s:                     72.11

Throughput:
    read, MiB/s:                  0.36
    written, MiB/s:               0.24

General statistics:
    total time:                          10.3831s
    total number of events:              893

Latency (ms):
         min:                                    0.02
         avg:                                   22.34
         max:                                  196.34
         95th percentile:                       80.03
         sum:                                19952.03

Threads fairness:
    events (avg/stddev):           446.5000/2.50
    execution time (avg/stddev):   9.9760/0.02